Data/Section 5/5.2/Client/VM3_Instance1/rep2/output_C2_T1_W64_K6_R2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       40497 ops,     334 (avg:     449) ops/sec, 1.19MB/sec (avg: 1.60MB/sec),  5.96 (avg:  4.43) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         224.98          ---          ---      4.42800       233.63
Gets         224.97      1349.81         0.00      4.42900      1404.45
Waits          0.00          ---          ---      0.00000          ---
Totals       449.95      1349.81         0.00      4.42800      1638.08


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.500         0.01
SET       1.600         0.04
SET       1.700         0.31
SET       1.800         1.03
SET       1.900         2.73
SET       2.000         5.35
SET       2.100         8.79
SET       2.200        12.94
SET       2.300        17.18
SET       2.400        21.18
SET       2.500        25.08
SET       2.600        28.59
SET       2.700        31.90
SET       2.800        34.61
SET       2.900        37.23
SET       3.000        39.51
SET       3.100        41.56
SET       3.200        43.64
SET       3.300        45.70
SET       3.400        47.28
SET       3.500        48.67
SET       3.600        49.96
SET       3.700        51.16
SET       3.800        52.49
SET       3.900        53.43
SET       4.000        54.54
SET       4.100        55.67
SET       4.200        56.84
SET       4.300        57.98
SET       4.400        59.23
SET       4.500        60.43
SET       4.600        61.70
SET       4.700        63.01
SET       4.800        64.25
SET       4.900        65.53
SET       5.000        66.70
SET       5.100        67.80
SET       5.200        68.93
SET       5.300        70.16
SET       5.400        71.50
SET       5.500        72.81
SET       5.600        74.06
SET       5.700        75.34
SET       5.800        76.51
SET       5.900        77.78
SET       6.000        79.13
SET       6.100        80.45
SET       6.200        81.62
SET       6.300        82.83
SET       6.400        83.74
SET       6.500        84.66
SET       6.600        85.60
SET       6.700        86.56
SET       6.800        87.33
SET       6.900        88.03
SET       7.000        88.62
SET       7.100        89.24
SET       7.200        89.90
SET       7.300        90.40
SET       7.400        90.92
SET       7.500        91.42
SET       7.600        91.79
SET       7.700        92.13
SET       7.800        92.53
SET       7.900        92.87
SET       8.000        93.22
SET       8.100        93.53
SET       8.200        93.83
SET       8.300        94.08
SET       8.400        94.37
SET       8.500        94.55
SET       8.600        94.76
SET       8.700        94.91
SET       8.800        95.11
SET       8.900        95.26
SET       9.000        95.46
SET       9.100        95.62
SET       9.200        95.85
SET       9.300        96.04
SET       9.400        96.30
SET       9.500        96.50
SET       9.600        96.63
SET       9.700        96.79
SET       9.800        96.91
SET       9.900        97.03
SET      10.000        97.61
SET      11.000        98.37
SET      12.000        98.73
SET      13.000        98.99
SET      14.000        99.22
SET      15.000        99.41
SET      16.000        99.51
SET      17.000        99.58
SET      18.000        99.65
SET      19.000        99.70
SET      20.000        99.77
SET      21.000        99.83
SET      22.000        99.85
SET      23.000        99.88
SET      24.000        99.89
SET      25.000        99.92
SET      26.000        99.93
SET      27.000        99.94
SET      28.000        99.95
SET      29.000        99.96
SET      30.000        99.97
SET      31.000        99.98
SET      32.000        99.99
SET      37.000        99.99
SET      40.000       100.00
SET      70.000       100.00
---
GET       1.700         0.00
GET       1.800         0.05
GET       1.900         0.34
GET       2.000         1.11
GET       2.100         2.80
GET       2.200         5.52
GET       2.300         9.26
GET       2.400        13.71
GET       2.500        18.44
GET       2.600        23.04
GET       2.700        27.48
GET       2.800        31.53
GET       2.900        35.33
GET       3.000        38.55
GET       3.100        41.36
GET       3.200        43.87
GET       3.300        46.10
GET       3.400        48.11
GET       3.500        49.90
GET       3.600        51.35
GET       3.700        52.71
GET       3.800        54.11
GET       3.900        55.30
GET       4.000        56.40
GET       4.100        57.46
GET       4.200        58.43
GET       4.300        59.42
GET       4.400        60.54
GET       4.500        61.70
GET       4.600        62.75
GET       4.700        63.94
GET       4.800        65.07
GET       4.900        66.16
GET       5.000        67.34
GET       5.100        68.58
GET       5.200        69.74
GET       5.300        70.80
GET       5.400        72.01
GET       5.500        73.32
GET       5.600        74.60
GET       5.700        75.97
GET       5.800        77.22
GET       5.900        78.46
GET       6.000        79.82
GET       6.100        81.03
GET       6.200        82.26
GET       6.300        83.36
GET       6.400        84.58
GET       6.500        85.60
GET       6.600        86.64
GET       6.700        87.49
GET       6.800        88.50
GET       6.900        89.28
GET       7.000        89.86
GET       7.100        90.44
GET       7.200        90.95
GET       7.300        91.48
GET       7.400        92.00
GET       7.500        92.48
GET       7.600        92.88
GET       7.700        93.23
GET       7.800        93.57
GET       7.900        93.90
GET       8.000        94.19
GET       8.100        94.47
GET       8.200        94.70
GET       8.300        94.92
GET       8.400        95.14
GET       8.500        95.33
GET       8.600        95.52
GET       8.700        95.74
GET       8.800        95.93
GET       8.900        96.09
GET       9.000        96.24
GET       9.100        96.40
GET       9.200        96.56
GET       9.300        96.71
GET       9.400        96.87
GET       9.500        97.02
GET       9.600        97.18
GET       9.700        97.29
GET       9.800        97.41
GET       9.900        97.53
GET      10.000        98.09
GET      11.000        98.75
GET      12.000        99.07
GET      13.000        99.23
GET      14.000        99.34
GET      15.000        99.45
GET      16.000        99.53
GET      17.000        99.60
GET      18.000        99.65
GET      19.000        99.69
GET      20.000        99.74
GET      21.000        99.77
GET      22.000        99.79
GET      23.000        99.83
GET      24.000        99.84
GET      25.000        99.85
GET      26.000        99.86
GET      27.000        99.87
GET      28.000        99.88
GET      29.000        99.89
GET      30.000        99.91
GET      31.000        99.92
GET      33.000        99.92
GET      34.000        99.93
GET      35.000        99.94
GET      36.000        99.95
GET      37.000        99.95
GET      38.000        99.96
GET      39.000        99.97
GET      40.000        99.98
GET      42.000        99.98
GET      67.000        99.99
GET      70.000       100.00
GET     170.000       100.00
---